import 'package:imitatio/src/datasets/models/food.dart';

class KkFoodData extends FoodDataset {
  @override
  List<String> get dishes {
    return const [
      'Бешбармак',
      'Куырдак',
      'Шашлык',
      'Плов',
      'Лагман',
      'Манты',
      'Самса',
      'Тандыр нан',
      'Сорпа',
      'Казы',
      'Шұжық',
      'Жая',
      'Құрт',
      'Қызартма',
      'Ақ нан',
    ];
  }

  @override
  List<String> get drinks {
    return const ['Шекер', 'Кымыз', 'Айран', 'Боза', 'Таркотан', 'Коктал'];
  }

  @override
  List<String> get fruits {
    return const [
      'Алма',
      'Арпы',
      'Алча',
      'Арык',
      'Крымсыз',
      'Курткөз',
      'Курт',
      'Торгay',
      'Кыzyлкөз',
      'Ұзын',
      'Инжир',
      'Шомполь',
    ];
  }

  @override
  List<String> get spices {
    return const [
      'Тұз',
      'Қара бұрыш',
      'Жеңсік',
      'Кориандр',
      'Сары май',
      'Жыңғыл',
      'Дарчин',
      'Кардамон',
      'Қызыл құрт',
      'Мускат',
      'Паприка',
      'Қызыл бұрыш',
      'Сарымсақ ұнтақ',
      'Пияз ұнтақ',
      'Базилик',
      'Орегано',
      'Тимьян',
      'Розмарин',
      'Лавр жапырақ',
      'Жұлдыз анис',
    ];
  }

  @override
  List<String> get vegetables {
    return const [
      'Картоп',
      'Пияз',
      'Сәбіз',
      'Капуста',
      'Томат',
      'Сұлы',
      'Бұлғар',
      'Шығыс',
      'Турп',
      'Сарымсақ',
      'Шампиньон',
      'Бадымша',
      'Кабачок',
      'Спинач',
      'Жасыл бұршақ',
      'Жүгері',
      'Қауын',
      'Қабақ',
      'Аспарагус',
      'Латук',
    ];
  }
}
