import 'package:imitatio/src/datasets/models/finance.dart';

class ArTnFinanceData extends FinanceDataset {
  @override
  List<String> get banks {
    return const [
      "البنك المركزي التونسي",
      "البنك الوطني الفلاحي",
      "البنك التونسي",
      "البنك العربي لتونس وصندوق الادخار",
      "البنك التونسي الكويتي",
      "البنك الفرنسي للتجارة",
      "البنك الشعبي",
      "البنك الإسلامي للتنمية",
      "البنك التونسي للتجارة الدولية",
      "البنك التونسي للتركيبات",
      "البنك التجاري التونسي",
      "البنك العربي",
      "البنك المغربي للتجارة الخارجية",
      "بنك الأمان",
      "بنك الزيتونة",
      "بنك تونس والامارات",
      "بنك تونس العربي الدولي",
      "بنك الشركات",
      "البنك التونسي للتضامن",
      "البنك الاستثماري",
    ];
  }

  @override
  List<String> get companies {
    return const [
      "شركة أسترازينيكا",
      "شركة ألبان التونسية",
      "شركة أنسور",
      "شركة أوبر",
      "شركة أوميجا",
      "شركة أير فرانس",
      "شركة أيكيا تونس",
      "شركة إيدين",
      "شركة إيفوار",
      "شركة إيكيا",
      "شركة الأدوية التونسية",
      "شركة البترول والغاز",
      "شركة التمويل",
      "شركة الجود",
      "شركة الجيل الجديد",
      "شركة الخطوط الجوية التونسية",
      "شركة الرافدين",
      "شركة العربية للطيران",
      "شركة الفيروز",
      "شركة الكترونيك تونس",
      "شركة الكهرباء والغاز",
      "شركة الكيماويات",
      "شركة المجموعة التونسية للطاقة",
      "شركة المراعي",
      "شركة المستقبل",
      "شركة المشرق",
      "شركة النسيج التونسي",
      "شركة النمط",
      "شركة النيل",
      "شركة برايس ووتر هاوس كوبرز",
      "شركة بركات",
      "شركة بوسطن",
      "شركة بيبسي تونس",
      "شركة تايلر",
      "شركة توتال تونس",
      "شركة تيليكوم تونس",
      "شركة جولدن بوي",
      "شركة جيب",
      "شركة دايسون",
      "شركة ريفيان",
      "شركة زين",
      "شركة زين",
      "شركة ساب",
      "شركة ساس",
      "شركة سامسونج تونس",
      "شركة سانوفي",
      "شركة سيمنز تونس",
      "شركة شال",
      "شركة فولفو",
      "شركة فولكس فاجن تونس",
      "شركة فيرفاكس",
      "شركة فيفاندي",
      "شركة قطر للبترول",
      "شركة كلوديل",
      "شركة كوبارت",
      "شركة كولجيت",
      "شركة كوين",
      "شركة ماريوت",
      "شركة مايلي",
      "شركة ميلكا",
      "شركة هارلي دافيدسون",
      "شركة يونيليفر تونس",
      "مجموعة دليس",
      "مجموعة سوناطراك",
      "مجموعة كاكتوس",
    ];
  }

  @override
  List<String> companyTypes({required bool isAbbr}) {
    return switch (isAbbr) {
      true => const [
        "شركة",
        "مؤسسة",
        "SARL",
        "SPA",
        "SPAS",
        "SNC",
        "صندوق",
        "شركة أجنبية",
        "تعاضدية",
        "تعاونية",
        "شركة قابضة",
      ],
      false => const [
        "شركة",
        "مؤسسة",
        "شركة ذات مسؤولية محدودة (SARL)",
        "شركة ذات أسهم (SPA)",
        "شركة المساهمة البسيطة (SPAS)",
        "شركة التضامن (SNC)",
        "صندوق",
        "شركة أجنبية",
        "تعاضدية",
        "تعاونية",
        "شركة قابضة",
      ],
    };
  }

  @override
  String get currencyCode => "TND";

  @override
  String get currencySymbol => 'DT';
}
