import 'package:imitatio/src/datasets/models/finance.dart';

class ArOmFinanceData extends FinanceDataset {
  @override
  List<String> get banks {
    return const [
      "بنك ظفار ش.م.ع.ع",
      "بنك مسقط ش م ع ع",
      "البنك الوطني العماني ش.م.ع.ع.ع",
      "بنك عمان العربي ش.م.ع.ع",
      "صحار الدولي",
      "البنك الأهلي ش م ع ع",
      "بنك الإسكان العماني ش.م.ع.م",
      "بنك التنمية",
      "بنك نزوى",
      "بنك العز الإسلامي ش.م.ع.م",
      "بنك ملي إيران",
      "بنك بارودا",
      "بنك صادرات إيران",
      "بنك ستاندرد تشارترد",
      "ستيت بنك أوف إنديا",
      "بنك بيروت",
      "بنك أبوظبي الأول",
      "بنك قطر الوطني",
    ];
  }

  @override
  List<String> get companies {
    return const [
      "مؤسسة الزبير",
      "مجموعة سهيل بهوان",
      "محسن حيدر درويش",
      "مجموعة الطيران العماني",
      "مجموعة دبليوجي تاول",
      "جلفار للهندسة والمقاولات",
      "النهضة للخدمات",
      "النورس للإتصالات السلكية واللاسلكية",
      "أسمنت عمان",
      "صلالة لخدمات المواني",
      "تسويق النفط العمانية",
      "مواصلات",
      "المطاحن العمانية",
      "صحار للطاقة",
      "أونك القابضة",
      "حديد الجزيرة",
      "الأنوار لبلاط السيراميك",
      "تأجير للتمويل",
      "تكافل عمان",
      "الصفاء للأغذية",
      "أعلاف ظفار",
      "المتحدة للطاقة",
    ];
  }

  @override
  List<String> companyTypes({required bool isAbbr}) {
    return switch (isAbbr) {
      true => const ["شركة", "مؤسسة", "مجموعة"],
      false => const ["شركة", "مؤسسة", "مجموعة"],
    };
  }

  @override
  String get currencyCode => "OMR";

  @override
  String get currencySymbol => 'ريال';
}
