import 'package:imitatio/src/datasets/models/food.dart';

class ArYeFoodData extends FoodDataset {
  @override
  List<String> get dishes {
    return const [
      "السلته",
      "الفحسة",
      "المندي",
      "المظبي",
      "المشوي",
      "العصيد",
      "الشفوت",
      "الكبسة",
      "الحنيذ",
      "الكدم",
      "البرم",
      "بنت الصحن",
      "زربيان",
      "سبايا",
      "سوسي",
      "ملوّح",
      "رشوش",
    ];
  }

  @override
  List<String> get drinks {
    return const [
      "قهوة بيضانية",
      "شاي عدني",
      "شاي بالحليب",
      "بن يمني",
      "شاي أحمر",
      "قهوة عربية",
      "شراب الليمون",
      "حليب الإبل",
      "حقين",
      "مشروبات غازية",
      "شراب الكركديه",
      "عصير الرمان",
      "عصير البرتقال",
      "عصير الليمون",
      "عصير التفاح",
      "عصير الجوافة",
      "عصير المانجو",
      "عصير الأناناس",
      "شربات",
      "عصير البطيخ",
      "عصير التوت",
      "الزنجبيل",
    ];
  }

  @override
  List<String> get fruits {
    return const [
      "تفاح",
      "موز",
      "برتقال",
      "فراولة",
      "أناناس",
      "كيوي",
      "جوافة",
      "مانجو",
      "رمان",
      "ليمون",
      "تين",
      "خوخ",
      "برقوق",
      "تمر",
      "عنب",
      "حبحب",
      "طماط",
      "أفوكادو",
      "التين الشوكي",
      "العنب",
      "التوت البري",
      "الكيوي",
    ];
  }

  @override
  List<String> get spices {
    return const [
      "كمون",
      "كزبرة",
      "قرفة",
      "قرنفل",
      "هيل",
      "زعفران",
      "فلفل أسود",
      "بسباس حيمي",
      "زنجبيل",
      "جوزة الطيب",
      "هرد",
      "كاري",
      "ريحان",
      "نعناع",
      "خردل",
      "زعتر",
      "شطة",
      "مسحوق الثوم",
      "مسحوق البصل",
      "ينسون",
      "بقدونس مجفف",
      "أوراق الغار",
      "كبزرة",
      "ملح الليمون",
      "ليمون مجفف",
    ];
  }

  @override
  List<String> get vegetables {
    return const [
      "جزر",
      "بطاط",
      "بصل",
      "فلفل",
      "كوسة",
      "باذنجان",
      "خيار",
      "قرنبيط",
      "سبانخ",
      "جرجير",
      "فجل",
      "شمندر",
      "كوبيش",
      "يقطين",
      "زهرة القرنبيط",
      "بروكلي",
      "فطر",
      "ثوم",
      "الباذنجان",
      "جزر هندي",
      "العدس",
      "البرسيم",
      "فاصولياء",
      "فول",
      "بازلاء",
    ];
  }
}
